{"pageProps":{"post":{"attributes":{"description":"Learn the basics of product management through user stories and prioritizing user needs. Validate user stories through research and keep users in mind throughout the product development process.","keywords":["product management","user stories","prioritization","research","product development"]},"html":"<p>As a learner who is interested in product management, I want a course to teach me the basics of what it means to be a product manager.</p>\n<p>That is a user story that (hopefully) represents you. When you are thinking about building products and features, you should start with user stories. I know it seems like a weird process to go through, but trust me that it is worth it. It forces you to enter a user&#39;s mindset and think through their problems and how they may wish a service might solve them. This sort of grounding in a user&#39;s mindset will serve you <em>very</em> well. It forces you to think, &quot;How can I come to my user?&quot; rather than &quot;How can I make my user come to me.&quot;</p>\n<h2 id=\"what-constitutes-a-user-story\">What constitutes a user story</h2>\n<p>A user story is almost always the form of &quot;as &lt;a certain type of person&gt;, I want to &lt;do something&gt;.&quot; You identify what kind of user they are (a customer, a shopper, an admin, a moderator, an athlete, a chef, etc.) and what they may want to be able to do (purchase something, modify their email, remove a post, see my previous workouts, find new ingredients, etc.)</p>\n<p>Be careful these are not just reframings of what you wanted to do. &quot;As a worker with frequent users, I want to be able to use the Metaverse to take meetings.&quot; This is just taking what <em>you</em> want the user to do and reframing it as a user study. &quot;As a worker who takes frequent meetings, I want to have a more personal experience with my coworkers despite a remote culture&quot; would be a much better framing of a user story.</p>\n<p>&quot;As a worker who takes frequent meetings, I want to have a more personal experience with my coworkers despite a remote culture.&quot;</p>\n<p>Do you think that&#39;s true? I don&#39;t, and I certainly don&#39;t think the Metaverse solves that. That would be my biggest criticism of the Metaverse thus far: it&#39;s a product in search of a problem as opposed to being a product that solves users&#39; problems.</p>\n<p>However, we, as product managers, are but mere mortals and don&#39;t have all the answers. We frequently make guesses and are wrong. Our &quot;product sense&quot; (as tech companies like to call that) can intuit some of the answers, but we will get some wrong. Therefore, it is useful to keep your thinking grounded in users.</p>\n<h2 id=\"research\">Research</h2>\n<p>One thing you should do is <em>validate</em> user stories by doing research of some variety. Sometimes, that&#39;s as easy as browsing StackOverflow or Reddit to see what your users are saying about your product. Other times, you might call up some of your customers and ask them what problems they are facing. You can also ask them, &quot;If we did X, would it solve your problem for you?&quot; and get some good feedback that way.</p>\n<p>A word of caution when speaking with your customers: a lot of the time, your customers don&#39;t actually know what they want. They&#39;ll say, &quot;Yes, I want feature X,&quot; but in reality, if you build it, no one is going to use it. They&#39;ll think they want something, but in reality, it is just an indication that there&#39;s a problem there that isn&#39;t being solved correctly. It can be a symptom of something else.</p>\n<p>Another word of caution here is that frequently, you have a loud minority of users who will clamor for something when, in fact, they are a very small minority of the users. Anyone who has worked on a social network will know that only a single-digit percentage of people make any posts that have any traction but will have an outsized voice when it comes to feature requests. It&#39;s a biased sample set.</p>\n<p>The best kind of feedback comes from UX researchers. They will put your product in front of people and watch them use it. That way, you don&#39;t bias your outcomes by leading them; they let them use the product and then pass that feedback on to you on how they used it.</p>\n<h2 id=\"what-to-do-with-user-stories\">What to do with user stories</h2>\n<p>Okay, so now you have some user stories. Now what? At this point, you would prioritize them (we will talk about that next section), pick a few, and plan to work on them. You will take some of those user studies and propose solutions that fulfill your user studies. You will take some of those solutions and turn them into product specifications, which then are passed to design and engineering to turn into products and features.</p>\n<p>Just always keep your users in mind. That alone will give you a leg up on a lot of product managers.</p>\n","markdown":"\nAs a learner who is interested in product management, I want a course to teach me the basics of what it means to be a product manager.\n\nThat is a user story that (hopefully) represents you. When you are thinking about building products and features, you should start with user stories. I know it seems like a weird process to go through, but trust me that it is worth it. It forces you to enter a user's mindset and think through their problems and how they may wish a service might solve them. This sort of grounding in a user's mindset will serve you _very_ well. It forces you to think, \"How can I come to my user?\" rather than \"How can I make my user come to me.\"\n\n## What constitutes a user story\n\nA user story is almost always the form of \"as \\<a certain type of person>, I want to \\<do something>.\" You identify what kind of user they are (a customer, a shopper, an admin, a moderator, an athlete, a chef, etc.) and what they may want to be able to do (purchase something, modify their email, remove a post, see my previous workouts, find new ingredients, etc.)\n\nBe careful these are not just reframings of what you wanted to do. \"As a worker with frequent users, I want to be able to use the Metaverse to take meetings.\" This is just taking what _you_ want the user to do and reframing it as a user study. \"As a worker who takes frequent meetings, I want to have a more personal experience with my coworkers despite a remote culture\" would be a much better framing of a user story.\n\n\"As a worker who takes frequent meetings, I want to have a more personal experience with my coworkers despite a remote culture.\"\n\nDo you think that's true? I don't, and I certainly don't think the Metaverse solves that. That would be my biggest criticism of the Metaverse thus far: it's a product in search of a problem as opposed to being a product that solves users' problems.\n\nHowever, we, as product managers, are but mere mortals and don't have all the answers. We frequently make guesses and are wrong. Our \"product sense\" (as tech companies like to call that) can intuit some of the answers, but we will get some wrong. Therefore, it is useful to keep your thinking grounded in users.\n\n## Research\n\nOne thing you should do is _validate_ user stories by doing research of some variety. Sometimes, that's as easy as browsing StackOverflow or Reddit to see what your users are saying about your product. Other times, you might call up some of your customers and ask them what problems they are facing. You can also ask them, \"If we did X, would it solve your problem for you?\" and get some good feedback that way.\n\nA word of caution when speaking with your customers: a lot of the time, your customers don't actually know what they want. They'll say, \"Yes, I want feature X,\" but in reality, if you build it, no one is going to use it. They'll think they want something, but in reality, it is just an indication that there's a problem there that isn't being solved correctly. It can be a symptom of something else.\n\nAnother word of caution here is that frequently, you have a loud minority of users who will clamor for something when, in fact, they are a very small minority of the users. Anyone who has worked on a social network will know that only a single-digit percentage of people make any posts that have any traction but will have an outsized voice when it comes to feature requests. It's a biased sample set.\n\nThe best kind of feedback comes from UX researchers. They will put your product in front of people and watch them use it. That way, you don't bias your outcomes by leading them; they let them use the product and then pass that feedback on to you on how they used it.\n\n## What to do with user stories\n\nOkay, so now you have some user stories. Now what? At this point, you would prioritize them (we will talk about that next section), pick a few, and plan to work on them. You will take some of those user studies and propose solutions that fulfill your user studies. You will take some of those solutions and turn them into product specifications, which then are passed to design and engineering to turn into products and features.\n\nJust always keep your users in mind. That alone will give you a leg up on a lot of product managers.\n","slug":"user-stories","title":"User Stories","section":"Product","icon":"shapes","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/08-product/A-user-stories.md","nextSlug":"/lessons/product/product-specs","prevSlug":"/lessons/metrics/exercise"}},"__N_SSG":true}