{"pageProps":{"post":{"attributes":{"description":"Learn the importance of basic stats for product managers and how it can improve their understanding and storytelling with numbers. Topics covered include sampling, p-values, and effective graphing techniques.","keywords":["stats","basic stats for product managers","sampling","p-value","importance of stats for PMs","graphing techniques"]},"html":"<h2 id=\"stats\">Stats</h2>\n<p>Look, I&#39;m not a statistician. I didn&#39;t even take any stats classes until my master&#39;s program. Everything I&#39;ve learned has been as needed, and generally, I&#39;ve always had a data team to work with to bounce ideas off of. So, I&#39;m not going to teach you stats. However, I am going to tell you that you <em>should</em> learn some basic stats as a PM. It will help you understand what is happening and be able to storytell with numbers better.</p>\n<p>My master&#39;s program borrowed heavily from this book, <a href=\"https://www.openintro.org/book/stat/\">OpenStats</a>, which is free. Choose the OpenIntro Stats books if you <em>don&#39;t</em> want to write code, and choose Intro to Modern Stats if you <em>do</em> want to write code.</p>\n<p>I&#39;ll leave here a few key things to think about when working with stats as a PM.</p>\n<h3 id=\"sampling\">Sampling</h3>\n<p>If you take a <em>truly random</em> sample of a large group and the sample is large enough, it will be representative of the whole. A key here is that it has to be truly random. If you start biasing this sample at all by selecting all men or selecting only people who will respond to emails, etc., then the sample is no longer representative of the whole as you&#39;ve biased the sample.</p>\n<p>Why do we talk about this? A big part of being a good PM is talking to your users. Part of that will be running studies on your users. If you can get a random sampling of your users and run some experiments, you can get information about what helps your product and what doesn&#39;t.</p>\n<h3 id=\"the-p-value\">The p-value</h3>\n<p>This isn&#39;t the most advanced stats concept we will chat about, but it is important. A p-value can be thought of: &quot;How confident are we in this statement.&quot; A more accurate way to state what the p-value is is, &quot;How likely is there that these results would happen if the things we are measuring are totally uncorrelated to each other.&quot; But you can think, &quot;lower p-values mean these two things are more closely correlated.&quot;</p>\n<p>I&#39;m not going to get too much more into it other than when you are presented with findings from a study either from your data team or from an outside researcher; it&#39;s good to ask what the p-values were. A lot of people arbitrarily have chosen a p-value of .05 (or 5%) as the threshold to call something statistically significant. That would mean there&#39;s a 5% chance that the study you just conducted was total happenstance and the two things are actually uncorrelated and a 95% that the two things indeed are correlated.</p>\n<p>An example of that is if we did a study changing the button of our checkout process from black to red, and we saw an uptick in revenue of 15%. Then, we did a study on that to see if that was a causative relationship. If we found a p-value of .04 in the resulting study, we would say yes, the red did change the revenue. If it was .12, we would say it was inconclusive.</p>\n<h2 id=\"a-little-bit-of-graphing\">A little bit of graphing</h2>\n<p>Okay, so we have some stats in us now. Let&#39;s talk about graphs and showing metrics.</p>\n<p>⛔️ First rule is never use pie charts. ⛔️</p>\n<p>Now we have that out of the way, let&#39;s talk about <em>why</em> you want to use graphs. When we use metrics in papers and meetings, we need to have a reason to look at them. Numbers by themselves are not useful to show off; we use them to tell stories, describe changes, and identify needs.</p>\n<p><img src=\"/images/chart.jpg\" alt=\"Chart chooser\">\n<sup>Via <a href=\"https://extremepresentation.com/about-the-extreme-presentation-method/\">The Extreme Presentation™ Method</a></sup></p>\n<p>The above helper (or any other on the Internet) can help you choose an appropriate chart for the story you&#39;re trying to tell. Sometimes, you&#39;re trying to emphasize climbing costs in which a line graph could help, or one segment of all costs is growing faster than other segments in which a stacked bar chart could tell that story really well.</p>\n<p>My point here is that point some thought into &quot;what is a person glancing at this chart going to pick up on first.&quot; Use color, labels, and appropriate graph types to drive home points. A well-made graph can make a whole presentation.</p>\n<p>Also, never use pie charts. Humans are not good at judging areas at a glance or working with changes in angles. They don&#39;t tell stories well at all, and there is <em>always</em> a better graph to choose.</p>\n","markdown":"\n## Stats\n\nLook, I'm not a statistician. I didn't even take any stats classes until my master's program. Everything I've learned has been as needed, and generally, I've always had a data team to work with to bounce ideas off of. So, I'm not going to teach you stats. However, I am going to tell you that you _should_ learn some basic stats as a PM. It will help you understand what is happening and be able to storytell with numbers better.\n\nMy master's program borrowed heavily from this book, [OpenStats][os], which is free. Choose the OpenIntro Stats books if you _don't_ want to write code, and choose Intro to Modern Stats if you _do_ want to write code.\n\nI'll leave here a few key things to think about when working with stats as a PM.\n\n### Sampling\n\nIf you take a _truly random_ sample of a large group and the sample is large enough, it will be representative of the whole. A key here is that it has to be truly random. If you start biasing this sample at all by selecting all men or selecting only people who will respond to emails, etc., then the sample is no longer representative of the whole as you've biased the sample.\n\nWhy do we talk about this? A big part of being a good PM is talking to your users. Part of that will be running studies on your users. If you can get a random sampling of your users and run some experiments, you can get information about what helps your product and what doesn't.\n\n### The p-value\n\nThis isn't the most advanced stats concept we will chat about, but it is important. A p-value can be thought of: \"How confident are we in this statement.\" A more accurate way to state what the p-value is is, \"How likely is there that these results would happen if the things we are measuring are totally uncorrelated to each other.\" But you can think, \"lower p-values mean these two things are more closely correlated.\"\n\nI'm not going to get too much more into it other than when you are presented with findings from a study either from your data team or from an outside researcher; it's good to ask what the p-values were. A lot of people arbitrarily have chosen a p-value of .05 (or 5%) as the threshold to call something statistically significant. That would mean there's a 5% chance that the study you just conducted was total happenstance and the two things are actually uncorrelated and a 95% that the two things indeed are correlated.\n\nAn example of that is if we did a study changing the button of our checkout process from black to red, and we saw an uptick in revenue of 15%. Then, we did a study on that to see if that was a causative relationship. If we found a p-value of .04 in the resulting study, we would say yes, the red did change the revenue. If it was .12, we would say it was inconclusive.\n\n## A little bit of graphing\n\nOkay, so we have some stats in us now. Let's talk about graphs and showing metrics.\n\n⛔️ First rule is never use pie charts. ⛔️\n\nNow we have that out of the way, let's talk about _why_ you want to use graphs. When we use metrics in papers and meetings, we need to have a reason to look at them. Numbers by themselves are not useful to show off; we use them to tell stories, describe changes, and identify needs.\n\n![Chart chooser](/images/chart.jpg)\n<sup>Via <a href=\"https://extremepresentation.com/about-the-extreme-presentation-method/\">The Extreme Presentation™ Method</a></sup>\n\nThe above helper (or any other on the Internet) can help you choose an appropriate chart for the story you're trying to tell. Sometimes, you're trying to emphasize climbing costs in which a line graph could help, or one segment of all costs is growing faster than other segments in which a stacked bar chart could tell that story really well.\n\nMy point here is that point some thought into \"what is a person glancing at this chart going to pick up on first.\" Use color, labels, and appropriate graph types to drive home points. A well-made graph can make a whole presentation.\n\nAlso, never use pie charts. Humans are not good at judging areas at a glance or working with changes in angles. They don't tell stories well at all, and there is _always_ a better graph to choose.\n\n[os]: https://www.openintro.org/book/stat/\n","slug":"stats-and-graphs","title":"Stats and Graphs","section":"Metrics","icon":"chart-column","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/07-metrics/A-stats-and-graphs.md","nextSlug":"/lessons/metrics/team-and-project-metrics","prevSlug":"/lessons/meetings/exercise"}},"__N_SSG":true}