{"pageProps":{"post":{"attributes":{"description":"Learn about the importance of metrics in product management, including team/organization metrics and project metrics. Discover key metrics for Netflix, such as sign-ups, retention, revenue, and watch-hours. Understand how CSAT (Customer Satisfaction) is a relative metric that should be tracked but not overemphasized.","keywords":["metrics","product management","team metrics","organization metrics","project metrics","Netflix metrics","customer satisfaction"]},"html":"<p>Armed with some stats and graphs, let&#39;s chat about metrics. Metrics should be the numerical manifestation of what an outcome looks like to you. Is success a lot of people signing up? Is success less support tickets? Is success making users have to click less to achieve their intents? All of your product goals, planned features, and anything else you do and plan as a PM should manifest itself as changes in metrics. It&#39;s how you measure your and your team&#39;s success and validate you are doing the right things.</p>\n<h2 id=\"team--organization-metrics\">Team / Organization Metrics</h2>\n<p>If your team and/or organization does not have top-level (often called &quot;North Star&quot; because they guide you) metrics, now is a good time to change that or at least clarify what they are for yourself. These are the metrics that <em>everyone</em> should be working towards; anything that drives these up should be worthy of working on and anything that <em>doesn&#39;t</em> somehow affect these metrics should be strongly questioned.</p>\n<p>Let&#39;s look at Netflix. What do you think their top-level metrics are?</p>\n<ul>\n<li>Sign ups: getting new people in the pipeline is always the goal</li>\n<li>Retention: once someone signs up, we want to keep them</li>\n<li>Revenue: if we can get a person to sign up for a higher tier (and have them be happy about it), we should do that</li>\n<li>Watch-hours: people who use our great product are more likely to stick around</li>\n</ul>\n<p>I&#39;m sure they have more (they did when I was there), but these are some pretty basic ones that most anything else will end up affecting these metrics anyway, e.g., if we drive down support tickets, in theory, we should be retaining people better because people with support problems tend not to be happy.</p>\n<p>So now your organization has key metrics to follow. Your <em>team</em> should have goals and metrics that then affect the company metrics. Let&#39;s say you work on the sign up process for Netflix (I did!); what would your key metrics be?</p>\n<ul>\n<li>Sign ups: duh</li>\n<li>Time to sign up: if a user has the intent to sign up, how fast can we get them from zero to done?</li>\n<li>Bounce rate: A high bounce rate would indicate that we are losing people who would sign up but are hitting a snag somewhere.</li>\n<li>30 day retention: signing people up just to churn them later isn&#39;t great. It means that they might be surprised by something like cost, a lack of a feature, or something else we could educate them about in the sign up process.</li>\n</ul>\n<p>These are just some off the top of my head. But then, your team&#39;s charter metrics make sense in the context of company goals, which should always be the case. If it doesn&#39;t, it means either your company&#39;s metrics aren&#39;t right, or yours aren&#39;t.</p>\n<h2 id=\"project-metrics\">Project Metrics</h2>\n<p>It stands to reason that any project you undertake should affect your team metrics. Whenever I start a new project, I generally write down the problem I&#39;m trying to solve and then the metrics used to measure if we are going to be successful or not. If possible, I will make a little dashboard for each project so I can keep track of whether our projects are successful or not.</p>\n<p>So, imagine you are starting a new sign up project for Netflix. You are going to stop collecting zip code information during the credit card credentials process. If you don&#39;t know, it&#39;s not required to get the zip code, but if you do, then you get slightly cheaper fees and certainly less fraud. However, it will be even faster (in theory) for people to sign up, and that means less bounce. So, our metrics for this project would be</p>\n<ul>\n<li>Sign ups</li>\n<li>Time to sign up</li>\n<li>Bounce rate</li>\n<li>Revenue</li>\n</ul>\n<p>In this project, we would also want to have very clear rollback criteria. If we are not signing people up at a larger rate, then we would want to roll this project back because it would affect revenue adversely.</p>\n<h2 id=\"a-note-on-csat\">A note on CSAT</h2>\n<p>CSAT is a metric a lot of companies measure that means customer satisfaction. It will be measured in a variety of ways, but it usually is some survey or form that is thrust in front of users at some point. It <em>is</em> a good thing to track, and you should generally monitor its status over time, but be careful not to over-index on it.</p>\n<p>It is a relative metric in that it is relative to itself. If you are measuring customer satisfaction with the sign up process, paying for stuff isn&#39;t ever fun. Neither is filling out forms. The best you can hope for is &quot;not painful&quot; when a user evaluates your product. Compare that with the team that does the video watching. They genuinely can hope for &quot;I love this product so much&quot; in their feedback. Imagine sign up was a 4.1/5, and the video-watching team got a 4.9/5. Should we be mad at the sign up team? No, not at all, because comparing the two doesn&#39;t make sense. However, if the video team&#39;s metric slips to 4.8 they should care about that and the sign up team should celebrate getting to 4.3. They&#39;re relative to themselves.</p>\n<blockquote>\n<p>Even when I was managing SDKs I couldn&#39;t compare across languages. Java developers consistently lowly rated our (and basically every SDK) because they&#39;re just salty folks. Whereas we had serious issues with the Node.js SDK and we still got high marks from them. It&#39;s always contextual to the demographic.</p>\n</blockquote>\n<p>Therefore, be careful in making CSAT a focused-upon metric. Track it, absolutely, but recognize its weaknesses. It&#39;s not useful to look at by itself. Driving up sign ups while not affecting CSAT is a huge win. Things like that.</p>\n","markdown":"\nArmed with some stats and graphs, let's chat about metrics. Metrics should be the numerical manifestation of what an outcome looks like to you. Is success a lot of people signing up? Is success less support tickets? Is success making users have to click less to achieve their intents? All of your product goals, planned features, and anything else you do and plan as a PM should manifest itself as changes in metrics. It's how you measure your and your team's success and validate you are doing the right things.\n\n## Team / Organization Metrics\n\nIf your team and/or organization does not have top-level (often called \"North Star\" because they guide you) metrics, now is a good time to change that or at least clarify what they are for yourself. These are the metrics that _everyone_ should be working towards; anything that drives these up should be worthy of working on and anything that _doesn't_ somehow affect these metrics should be strongly questioned.\n\nLet's look at Netflix. What do you think their top-level metrics are?\n\n- Sign ups: getting new people in the pipeline is always the goal\n- Retention: once someone signs up, we want to keep them\n- Revenue: if we can get a person to sign up for a higher tier (and have them be happy about it), we should do that\n- Watch-hours: people who use our great product are more likely to stick around\n\nI'm sure they have more (they did when I was there), but these are some pretty basic ones that most anything else will end up affecting these metrics anyway, e.g., if we drive down support tickets, in theory, we should be retaining people better because people with support problems tend not to be happy.\n\nSo now your organization has key metrics to follow. Your _team_ should have goals and metrics that then affect the company metrics. Let's say you work on the sign up process for Netflix (I did!); what would your key metrics be?\n\n- Sign ups: duh\n- Time to sign up: if a user has the intent to sign up, how fast can we get them from zero to done?\n- Bounce rate: A high bounce rate would indicate that we are losing people who would sign up but are hitting a snag somewhere.\n- 30 day retention: signing people up just to churn them later isn't great. It means that they might be surprised by something like cost, a lack of a feature, or something else we could educate them about in the sign up process.\n\nThese are just some off the top of my head. But then, your team's charter metrics make sense in the context of company goals, which should always be the case. If it doesn't, it means either your company's metrics aren't right, or yours aren't.\n\n## Project Metrics\n\nIt stands to reason that any project you undertake should affect your team metrics. Whenever I start a new project, I generally write down the problem I'm trying to solve and then the metrics used to measure if we are going to be successful or not. If possible, I will make a little dashboard for each project so I can keep track of whether our projects are successful or not.\n\nSo, imagine you are starting a new sign up project for Netflix. You are going to stop collecting zip code information during the credit card credentials process. If you don't know, it's not required to get the zip code, but if you do, then you get slightly cheaper fees and certainly less fraud. However, it will be even faster (in theory) for people to sign up, and that means less bounce. So, our metrics for this project would be\n\n- Sign ups\n- Time to sign up\n- Bounce rate\n- Revenue\n\nIn this project, we would also want to have very clear rollback criteria. If we are not signing people up at a larger rate, then we would want to roll this project back because it would affect revenue adversely.\n\n## A note on CSAT\n\nCSAT is a metric a lot of companies measure that means customer satisfaction. It will be measured in a variety of ways, but it usually is some survey or form that is thrust in front of users at some point. It _is_ a good thing to track, and you should generally monitor its status over time, but be careful not to over-index on it.\n\nIt is a relative metric in that it is relative to itself. If you are measuring customer satisfaction with the sign up process, paying for stuff isn't ever fun. Neither is filling out forms. The best you can hope for is \"not painful\" when a user evaluates your product. Compare that with the team that does the video watching. They genuinely can hope for \"I love this product so much\" in their feedback. Imagine sign up was a 4.1/5, and the video-watching team got a 4.9/5. Should we be mad at the sign up team? No, not at all, because comparing the two doesn't make sense. However, if the video team's metric slips to 4.8 they should care about that and the sign up team should celebrate getting to 4.3. They're relative to themselves.\n\n> Even when I was managing SDKs I couldn't compare across languages. Java developers consistently lowly rated our (and basically every SDK) because they're just salty folks. Whereas we had serious issues with the Node.js SDK and we still got high marks from them. It's always contextual to the demographic.\n\nTherefore, be careful in making CSAT a focused-upon metric. Track it, absolutely, but recognize its weaknesses. It's not useful to look at by itself. Driving up sign ups while not affecting CSAT is a huge win. Things like that.\n","slug":"team-and-project-metrics","title":"Team and Project Metrics","section":"Metrics","icon":"chart-column","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/07-metrics/B-team-and-project-metrics.md","nextSlug":"/lessons/metrics/exercise","prevSlug":"/lessons/metrics/stats-and-graphs"}},"__N_SSG":true}