{"pageProps":{"post":{"attributes":{"description":"Learn how to apply principles of good communication to technical writing, emphasizing the importance of understanding your audience and delivering a focused message. Discover the power of effective writing in influencing people and organizations.","keywords":["technical writing","principles of good communication","audience understanding","focused message","influencing people","power of effective writing"]},"html":"<p>The previous chapter was all about the principles of good communication. Let&#39;s take these principles and apply them <em>specifically</em> to technical writing.</p>\n<p>If you have never taken technical writing, it is wildly different than what most folks learn in high school to prepare them for the SAT or the ACT. Technical writing is all about &quot;How do I communicate my point effectively and efficiently?&quot; and not about entertaining the user or making them think deeper or anything like that.</p>\n<p>A lot of being a PM is writing. I dare say it is most of it. You write a lot of emails, meeting agendas, product specs, tech specs, requests, etc. Being a good writer is a superpower of a good PM. Being a bad writer is an anchor.</p>\n<p>I will say that I don&#39;t necessarily <em>like</em> writing. I don&#39;t hate it either, but it&#39;s not like I get in front of my MacBook and get giddy. Hell, I&#39;m writing this right now, and I&#39;m not buzzing with excitement (you weren&#39;t expecting this to get meta, were you? I wasn&#39;t.)</p>\n<p>But being a good writer is such a lever for change in organizations. It is the best tool you own to influence people and organizations to do what you want them to do. A well-crafted memo or email can have viral effects as people pass it around. A good slide deck can move companies. I&#39;ve seen and done both.</p>\n<p>So let&#39;s recap the last section through the lens of technical writing.</p>\n<h2 id=\"who-is-reading-your-email--memo--slide-deck\">Who is reading your email / memo / slide deck?</h2>\n<p>Before you start writing <em>anything</em>, have a good think about who is going to be reading your document. Keep in mind that it is not just who you are sending the doc to, but who they might show it to as well. A good example is that I recently wrote a team charter doc to codify who my team is and what they do. Initially, the doc was written to get my team all aligned on what we were working towards, but that doc lives longer than that: it informs new engineers joining the team what the team does; it informs leadership how the team sees itself; it informs sister teams how to engage with my team. I needed to write that doc with <em>all</em> of those potential readers in mind. It, therefore, needed to address the concerns of all of those readers as well as offer enough context-setting information to get any reader in the correct mindset to understand the team charter. It <em>didn&#39;t</em> need to convince the reader that our product was superior; it wasn&#39;t external facing, and any reader would already be bought into the organizational vision.</p>\n<p>Some docs are just written to share quickly; no need to overthink it. Just make sure you are always focusing on who the reader is. Otherwise, you can tend to wander and either over or under share, both of which hurt your objective.</p>\n<h2 id=\"say-less\">Say less</h2>\n<p>We went over it before because it ties into writing for your audience, but less is more when it comes to writing docs. Ruthlessly cut unnecessary sections from docs. When a small percentage of your readers need additional context, link to additional docs with the necessary context or add appendixes. Do whatever you can to keep your doc laser-focused on delivering your message.</p>\n<p>A good question to ask yourself is, &quot;How much time do I anticipate people will take to read this doc?&quot; I will state that <em>rarely</em> a reader will take more than five minutes to read a doc. One to two is a pretty engaged reader. Five minutes is a highly engaged reader. For anything more, it means that the doc is directly pertinent to the reader e.g. a designer reading a product spec to be able to design the interface. So whatever you write, plan to get your point across in that time or less, whatever you planned for the reader to spend. Use that time wisely.</p>\n","markdown":"\nThe previous chapter was all about the principles of good communication. Let's take these principles and apply them _specifically_ to technical writing.\n\nIf you have never taken technical writing, it is wildly different than what most folks learn in high school to prepare them for the SAT or the ACT. Technical writing is all about \"How do I communicate my point effectively and efficiently?\" and not about entertaining the user or making them think deeper or anything like that.\n\nA lot of being a PM is writing. I dare say it is most of it. You write a lot of emails, meeting agendas, product specs, tech specs, requests, etc. Being a good writer is a superpower of a good PM. Being a bad writer is an anchor.\n\nI will say that I don't necessarily _like_ writing. I don't hate it either, but it's not like I get in front of my MacBook and get giddy. Hell, I'm writing this right now, and I'm not buzzing with excitement (you weren't expecting this to get meta, were you? I wasn't.)\n\nBut being a good writer is such a lever for change in organizations. It is the best tool you own to influence people and organizations to do what you want them to do. A well-crafted memo or email can have viral effects as people pass it around. A good slide deck can move companies. I've seen and done both.\n\nSo let's recap the last section through the lens of technical writing.\n\n## Who is reading your email / memo / slide deck?\n\nBefore you start writing _anything_, have a good think about who is going to be reading your document. Keep in mind that it is not just who you are sending the doc to, but who they might show it to as well. A good example is that I recently wrote a team charter doc to codify who my team is and what they do. Initially, the doc was written to get my team all aligned on what we were working towards, but that doc lives longer than that: it informs new engineers joining the team what the team does; it informs leadership how the team sees itself; it informs sister teams how to engage with my team. I needed to write that doc with _all_ of those potential readers in mind. It, therefore, needed to address the concerns of all of those readers as well as offer enough context-setting information to get any reader in the correct mindset to understand the team charter. It _didn't_ need to convince the reader that our product was superior; it wasn't external facing, and any reader would already be bought into the organizational vision.\n\nSome docs are just written to share quickly; no need to overthink it. Just make sure you are always focusing on who the reader is. Otherwise, you can tend to wander and either over or under share, both of which hurt your objective.\n\n## Say less\n\nWe went over it before because it ties into writing for your audience, but less is more when it comes to writing docs. Ruthlessly cut unnecessary sections from docs. When a small percentage of your readers need additional context, link to additional docs with the necessary context or add appendixes. Do whatever you can to keep your doc laser-focused on delivering your message.\n\nA good question to ask yourself is, \"How much time do I anticipate people will take to read this doc?\" I will state that _rarely_ a reader will take more than five minutes to read a doc. One to two is a pretty engaged reader. Five minutes is a highly engaged reader. For anything more, it means that the doc is directly pertinent to the reader e.g. a designer reading a product spec to be able to design the interface. So whatever you write, plan to get your point across in that time or less, whatever you planned for the reader to spend. Use that time wisely.\n","slug":"applying-previous-principles","title":"Applying Previous Principles","section":"Technical Writing","icon":"pencil","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/05-technical-writing/A-applying-previous-principles.md","nextSlug":"/lessons/technical-writing/use-formatting","prevSlug":"/lessons/communication/exercise"}},"__N_SSG":true}