{"pageProps":{"post":{"attributes":{"description":"Learn how to diagram and visualize the timeline of work using Google Drawings, Excalidraw, or any exercise tool of your choice, to effectively communicate the duration and overlapping nature of tasks in a formatting exercise. Find out how to showcase the timeline to the leadership team and coordinate design, UX research, and coding implementation efficiently.","keywords":["visualize timeline of work","Google Drawings","Excalidraw","exercise tool","formatting exercise","overlapping tasks","leadership team"]},"html":"<p>Using Google Drawings, Excalidraw, or any exercise tool of your choice, diagram out the timeline of work from the <a href=\"/lessons/technical-writing/formatting-exercise\">formatting exercise</a>. Then put the diagram in the doc that you previously did to really bring home your point to show the leadership team what the timeline is.</p>\n<p>To recap, the team is going to take 2 weeks in August to design. No other work can start until the designs are finished. Then, once the designs are done, both the UX research team can start research which will take two weeks, and the developers can start their coding implementation which will take four weeks.</p>\n<p>Chart out a visualization that emphasizes the overlapping nature of the work.</p>\n","markdown":"\nUsing Google Drawings, Excalidraw, or any exercise tool of your choice, diagram out the timeline of work from the [formatting exercise](/lessons/technical-writing/formatting-exercise). Then put the diagram in the doc that you previously did to really bring home your point to show the leadership team what the timeline is.\n\nTo recap, the team is going to take 2 weeks in August to design. No other work can start until the designs are finished. Then, once the designs are done, both the UX research team can start research which will take two weeks, and the developers can start their coding implementation which will take four weeks.\n\nChart out a visualization that emphasizes the overlapping nature of the work.\n","slug":"diagramming-exercise","title":"Diagramming Exercise","section":"Technical Writing","icon":"pencil","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/05-technical-writing/E-diagramming-exercise.md","nextSlug":"/lessons/technical-writing/executive-summaries","prevSlug":"/lessons/technical-writing/diagrams"}},"__N_SSG":true}