{"pageProps":{"post":{"attributes":{"description":"Learn how to write effective document summaries that capture the main points and encourage people to read your documents. Discover the concept of BLUF (bottom-line up front) and its benefits in saving time and improving communication. Find out how AI can help with summarization.","keywords":["document summaries","BLUF","bottom-line up front","writing tips","efficiency","communication","AI summarization"]},"html":"<p>I am about to share with you the biggest superpower that I can offer your memo writing. If you can get good at this, you can quickly align a lot of people. People will actually read the parts of docs that you want to. It&#39;s 🪄 magical ✨</p>\n<p>Here&#39;s our problem: we need to write long documents with lots of context to justify decisions. The context is necessary to both share context and allow others to follow our logic. The bigger the decision, typically, the longer the document. But people don&#39;t read long docs, which is a problem because we need long docs for important decisions. So what can we do about this conundrum: we need long docs, we need people to read our docs, and people don&#39;t read long docs.</p>\n<p>The executive summary. The TLDR. The BLUF. People call it a lot of things, but the idea remains the same: a very short summary at the beginning of the doc that summarizes what you want people to get out of it. This will let people know what you&#39;re about to tell them and allows you to get your point across without burying the lede.</p>\n<p>One of my favorite parts about working at Stripe is they have a very strong BLUF culture there. BLUF stands for bottom-line up front. Every doc had it while I worked there, and there was a culture that, if you agreed with what was in the BLUF, you could generally skip reading the doc. This intentional time-saving technique saved me a lot of time, and then that scaled up across a whole company probably resulted in person-years being saved.</p>\n<h2 id=\"how-to-write-a-good-summary\">How to write a good summary</h2>\n<p>The key to writing a good summary is writing the takeaway and sparing the context as much as possible. You want whoever is reading the doc to understand the &quot;delta&quot; or what is changing from before to after. Once you have identified your delta (which you could probably just call your point), then use a minimal amount of language to describe it. A good summary probably wouldn&#39;t be longer than 4 sentences, and best if it&#39;s 1 or 2 sentences. Whatever the case, whoever reads <em>just</em> the summary should understand what is changing. If they want to understand why, how, or other details, then the rest of the doc is there to support it, but <strong>a good summary is designed to eliminate the need to read the rest of the doc.</strong></p>\n<h2 id=\"cheating-or-using-ai-to-do-it-for-you\">Cheating, or using AI to do it for you</h2>\n<p>A lot of my job can&#39;t be done with AI helpers. ChatGPT doesn&#39;t know all the context necessary to do my job and doesn&#39;t yet have the creativity and synthesizing abilities that I do as a product manager. That may change someday, but that day is not today.</p>\n<p>However, do you know what ChatGPT / Bard / LLaMA are <em>really</em> good at? Summarizing things. You can basically say, &quot;Write a 2 sentence summary of this: &lt;paste doc&gt;&quot; and it will spit out a good summary. Usually, a tweak or two and it will yield something very workable.</p>\n<blockquote>\n<p>Do be careful putting company secrets into ChatGPT and the like. That&#39;s likely a no-no for your company.</p>\n</blockquote>\n<p>Notion has this built into it, which is <em>very</em> handy.</p>\n","markdown":"\nI am about to share with you the biggest superpower that I can offer your memo writing. If you can get good at this, you can quickly align a lot of people. People will actually read the parts of docs that you want to. It's 🪄 magical ✨\n\nHere's our problem: we need to write long documents with lots of context to justify decisions. The context is necessary to both share context and allow others to follow our logic. The bigger the decision, typically, the longer the document. But people don't read long docs, which is a problem because we need long docs for important decisions. So what can we do about this conundrum: we need long docs, we need people to read our docs, and people don't read long docs.\n\nThe executive summary. The TLDR. The BLUF. People call it a lot of things, but the idea remains the same: a very short summary at the beginning of the doc that summarizes what you want people to get out of it. This will let people know what you're about to tell them and allows you to get your point across without burying the lede.\n\nOne of my favorite parts about working at Stripe is they have a very strong BLUF culture there. BLUF stands for bottom-line up front. Every doc had it while I worked there, and there was a culture that, if you agreed with what was in the BLUF, you could generally skip reading the doc. This intentional time-saving technique saved me a lot of time, and then that scaled up across a whole company probably resulted in person-years being saved.\n\n## How to write a good summary\n\nThe key to writing a good summary is writing the takeaway and sparing the context as much as possible. You want whoever is reading the doc to understand the \"delta\" or what is changing from before to after. Once you have identified your delta (which you could probably just call your point), then use a minimal amount of language to describe it. A good summary probably wouldn't be longer than 4 sentences, and best if it's 1 or 2 sentences. Whatever the case, whoever reads _just_ the summary should understand what is changing. If they want to understand why, how, or other details, then the rest of the doc is there to support it, but **a good summary is designed to eliminate the need to read the rest of the doc.**\n\n## Cheating, or using AI to do it for you\n\nA lot of my job can't be done with AI helpers. ChatGPT doesn't know all the context necessary to do my job and doesn't yet have the creativity and synthesizing abilities that I do as a product manager. That may change someday, but that day is not today.\n\nHowever, do you know what ChatGPT / Bard / LLaMA are _really_ good at? Summarizing things. You can basically say, \"Write a 2 sentence summary of this: \\<paste doc>\" and it will spit out a good summary. Usually, a tweak or two and it will yield something very workable.\n\n> Do be careful putting company secrets into ChatGPT and the like. That's likely a no-no for your company.\n\nNotion has this built into it, which is _very_ handy.\n","slug":"executive-summaries","title":"Executive Summaries","section":"Technical Writing","icon":"pencil","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/05-technical-writing/F-executive-summaries.md","nextSlug":"/lessons/technical-writing/executive-summary-exercise","prevSlug":"/lessons/technical-writing/diagramming-exercise"}},"__N_SSG":true}