{"pageProps":{"post":{"attributes":{"description":"Learn how to drive understanding in your documents by using formatting effectively. Skim readers can quickly grasp the content through headings, bold and color, while longer documents may benefit from a table of contents. Emojis can also be used strategically to draw attention or add levity.","keywords":["formatting","driving understanding","skim readers","headings","bold","color","table of contents","emojis"]},"html":"<p>A simple hack to driving understanding is using formatting.</p>\n<p>Very few people are going to read word-for-word everything you put in a doc unless they are either confused and trying to understand or extremely interested in what you are saying. <strong>Most people skim docs.</strong> They look for headers and images to try and get the gist of your doc and its contents, and then they will spend additional time on parts of the docs that catch their interest. As the writer, you have the dual duty of making sure your reader finds the part they want to find <em>and</em> find the point you want them to walk away with.</p>\n<p>Enter formatting.</p>\n<p>Unlike your essays in secondary school or the novels you read, you are under no restriction of using formatting in your docs. Use them often and tactically to make sure your users find both what they want and what you want.</p>\n<p>Treat this more like web design than writing an essay.</p>\n<h2 id=\"use-headings\">Use headings</h2>\n<p>The easiest is to establish visual hierarchies by using headings. A bigger text size, some bolding, anything that helps a user visually slice and dice your page into approachable bites. Help them decide &quot;I don&#39;t want to read this&quot; and &quot;I need to read this&quot; at a glance. If your designer is reading a product spec and sees &quot;Kubernetes Configurations,&quot; they can decide at a glance that they can very lightly skim that area or skip it altogether. If the same designer sees &quot;Results from our UX Study,&quot; they know they need to slow down and read that carefully.</p>\n<h2 id=\"bold-and-color-are-your-secret-weapons\">Bold and color are your secret weapons</h2>\n<p>Particularly when you are trying to get points across quickly <strong>adding bold helps a lot</strong>. It strongly attracts the eye and helps you make important details skimmable. Be careful not to <em>overdo</em> it, as then the bold bits start to look the same as everything else.</p>\n<p>Italics are less helpful from the perspective of helping skim. They are more for adding a bit <em>emphasis</em> to something so people can understand you are stressing a word or a phrase.</p>\n<p>Adding color (red, green, etc.) can help and achieve similar effects. Just be extra cautious with it for two reasons: some colors can make it harder to read, like a light green against a white background, and colors can mean different things in different cultures. In America and many other Western cultures, green means positive and red means negative. While in China, Japan, and Korea, those meanings are reversed; red means positive and green means negative.</p>\n<p><img src=\"/images/colors.png\" alt=\"Colors across cultures\">\n<sup><a href=\"https://informationisbeautiful.net/visualizations/colours-in-cultures/\">Colours in Cultures</a>, DESIGN: AlwaysWithHonor.com and David McCandless. RESEARCH: David McCandless, Pearl Doughty-White, Alexia Wdowski, via InformationIsBeautiful.com</sup></p>\n<h2 id=\"long-doc-table-of-contents\">Long doc? Table of contents</h2>\n<p>Basically, every word processor now allows you to add a dynamic table of contents. For really long docs, I&#39;d recommend it; it allows people to orient themselves and quickly get to the parts they want to. For short docs, I&#39;d leave it out as it&#39;s just extra noise with no benefit.</p>\n<h2 id=\"🚨-emojis-🚨\">🚨 Emojis 🚨</h2>\n<p>This is going to depend on the culture of your company, but emojis can be another tool for drawing attention to something as well as adding a bit of levity to your doc (if that&#39;s appropriate.) I don&#39;t know if I&#39;d use this at a bank, but many tech companies keep it pretty light, so chucking some emojis in there or there makes sense. My current company ❤️ emojis, so I end up using them quite a bit.</p>\n","markdown":"\nA simple hack to driving understanding is using formatting.\n\nVery few people are going to read word-for-word everything you put in a doc unless they are either confused and trying to understand or extremely interested in what you are saying. **Most people skim docs.** They look for headers and images to try and get the gist of your doc and its contents, and then they will spend additional time on parts of the docs that catch their interest. As the writer, you have the dual duty of making sure your reader finds the part they want to find _and_ find the point you want them to walk away with.\n\nEnter formatting.\n\nUnlike your essays in secondary school or the novels you read, you are under no restriction of using formatting in your docs. Use them often and tactically to make sure your users find both what they want and what you want.\n\nTreat this more like web design than writing an essay.\n\n## Use headings\n\nThe easiest is to establish visual hierarchies by using headings. A bigger text size, some bolding, anything that helps a user visually slice and dice your page into approachable bites. Help them decide \"I don't want to read this\" and \"I need to read this\" at a glance. If your designer is reading a product spec and sees \"Kubernetes Configurations,\" they can decide at a glance that they can very lightly skim that area or skip it altogether. If the same designer sees \"Results from our UX Study,\" they know they need to slow down and read that carefully.\n\n## Bold and color are your secret weapons\n\nParticularly when you are trying to get points across quickly **adding bold helps a lot**. It strongly attracts the eye and helps you make important details skimmable. Be careful not to _overdo_ it, as then the bold bits start to look the same as everything else.\n\nItalics are less helpful from the perspective of helping skim. They are more for adding a bit _emphasis_ to something so people can understand you are stressing a word or a phrase.\n\nAdding color (red, green, etc.) can help and achieve similar effects. Just be extra cautious with it for two reasons: some colors can make it harder to read, like a light green against a white background, and colors can mean different things in different cultures. In America and many other Western cultures, green means positive and red means negative. While in China, Japan, and Korea, those meanings are reversed; red means positive and green means negative.\n\n![Colors across cultures](/images/colors.png)\n<sup><a href=\"https://informationisbeautiful.net/visualizations/colours-in-cultures/\">Colours in Cultures</a>, DESIGN: AlwaysWithHonor.com and David McCandless. RESEARCH: David McCandless, Pearl Doughty-White, Alexia Wdowski, via InformationIsBeautiful.com</sup>\n\n## Long doc? Table of contents\n\nBasically, every word processor now allows you to add a dynamic table of contents. For really long docs, I'd recommend it; it allows people to orient themselves and quickly get to the parts they want to. For short docs, I'd leave it out as it's just extra noise with no benefit.\n\n## 🚨 Emojis 🚨\n\nThis is going to depend on the culture of your company, but emojis can be another tool for drawing attention to something as well as adding a bit of levity to your doc (if that's appropriate.) I don't know if I'd use this at a bank, but many tech companies keep it pretty light, so chucking some emojis in there or there makes sense. My current company ❤️ emojis, so I end up using them quite a bit.\n","slug":"use-formatting","title":"Use Formatting","section":"Technical Writing","icon":"pencil","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/05-technical-writing/B-use-formatting.md","nextSlug":"/lessons/technical-writing/formatting-exercise","prevSlug":"/lessons/technical-writing/applying-previous-principles"}},"__N_SSG":true}