{"pageProps":{"post":{"attributes":{"description":"Plan a one-hour meeting around the formatting exercise memo, involving executives, technical stakeholders, and team members. Address the delay, reasons behind it, and future plans while discussing design, research, and development processes. Expect tension but a shared goal of launching new features.","keywords":["formatting exercise","memo","one-hour meeting","executives","technical stakeholders","team members","delay","design process","research","development process","launching new features"]},"html":"<p>Take the <a href=\"/lessons/technical-writing/formatting-exercise\">formatting exercise</a>&#39;s memo and plan a one-hour meeting around it. Assume you will have thirty people in it from a 5,000 person company. Of those thirty, ten will be executives, including the VP of product and the CEO, who want to understand the delay, the why, and what the plan is going forward. Assume ten more are technical stakeholders in your project, a few of which are impacted adversely by your delay and will be looking to push your team harder because their projects are delayed because of yours. Assume the last ten are your team members. Your designer is prepared to talk about the design process, your UX researcher is prepared to talk about the new research needed, and the tech lead is ready to talk about the development process. The tone of this meeting will be tense, but generally, everyone wants to launch new features.</p>\n<p>Write an agenda with timeboxes for this. What challenges do you expect? How can you organize your points to maximum effect?</p>\n<p>If you prefer, feel free to choose a different product to write about or even write one for your future meeting.</p>\n","markdown":"\nTake the [formatting exercise](/lessons/technical-writing/formatting-exercise)'s memo and plan a one-hour meeting around it. Assume you will have thirty people in it from a 5,000 person company. Of those thirty, ten will be executives, including the VP of product and the CEO, who want to understand the delay, the why, and what the plan is going forward. Assume ten more are technical stakeholders in your project, a few of which are impacted adversely by your delay and will be looking to push your team harder because their projects are delayed because of yours. Assume the last ten are your team members. Your designer is prepared to talk about the design process, your UX researcher is prepared to talk about the new research needed, and the tech lead is ready to talk about the development process. The tone of this meeting will be tense, but generally, everyone wants to launch new features.\n\nWrite an agenda with timeboxes for this. What challenges do you expect? How can you organize your points to maximum effect?\n\nIf you prefer, feel free to choose a different product to write about or even write one for your future meeting.\n","slug":"exercise","title":"Exercise","section":"Meetings","icon":"person-chalkboard","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/06-meetings/D-exercise.md","nextSlug":"/lessons/metrics/stats-and-graphs","prevSlug":"/lessons/meetings/running-the-meeting"}},"__N_SSG":true}