{"pageProps":{"post":{"attributes":{"description":"Congrats on finishing the course! This biased take on how to be a PM provides insights from a Microsoft, Stripe, and Snowflake perspective, acknowledging that there are multiple correct approaches to this role. Whether you're looking to enhance your PM skills or embark on a PM career, this class offers valuable lessons.","keywords":["PM course","Microsoft PM","Stripe PM","Snowflake PM","PM skills","PM journey"]},"html":"<p>Congrats on finishing the course!</p>\n<p>Just to restate, you got a very biased take on how to PM from a very Microsoft, Stripe, and Snowflake perspective. I consulted other PMs to make sure I wasn&#39;t too off base, but just know there are many correct ways to do this job. Some of this advice is the opposite of what <em>you</em> should do as you will do this job differently than me, and your company will work differently than mine. I truly did my best, and I hope it helps!</p>\n<p>Hopefully, you enjoyed it and learned a bit about being a PM, either to improve your skills as a PM or to continue your journey to become one. I hope you enjoyed the class, and best of luck on your journey!</p>\n","markdown":"\nCongrats on finishing the course!\n\nJust to restate, you got a very biased take on how to PM from a very Microsoft, Stripe, and Snowflake perspective. I consulted other PMs to make sure I wasn't too off base, but just know there are many correct ways to do this job. Some of this advice is the opposite of what _you_ should do as you will do this job differently than me, and your company will work differently than mine. I truly did my best, and I hope it helps!\n\nHopefully, you enjoyed it and learned a bit about being a PM, either to improve your skills as a PM or to continue your journey to become one. I hope you enjoyed the class, and best of luck on your journey!\n","slug":"congrats","title":"Congrats","section":"Conclusion","icon":"graduation-cap","filePath":"/home/runner/work/complete-intro-to-product-management/complete-intro-to-product-management/lessons/10-conclusion/A-congrats.md","nextSlug":null,"prevSlug":"/lessons/planning/exercise"}},"__N_SSG":true}